content/posts/link-roundup-june-17-2024.md
+++
title = "Link Roundup: June 17, 2024"
author = ["Rick Wysocki"]
date = 2024-06-17T00:00:00-04:00
draft = false
summary = "Here is my post summary."
+++

Here's some more interesting content I found this week. As with my last
link roundup, I generate summaries using AI tools (here I employ both
Chat-GPT and Claude) and edit those summaries for accuracy and
usefulness. Then, I offer some thoughts of my own.


## Vicky Zhao, "3 Simple Ways to Make Clear &amp; Concise Points | Stop {#vicky-zhao-3-simple-ways-to-make-clear-and-concise-points-stop}

Rambling!" AND Ian Daniel Stewart, "Engage your audience by getting to
the point, using story structure, and forcing specificity"

:CUSTOM_ID: vicky-zhao-3-simple-ways-to-make-clear-concise-points-stop-rambling-and-ian-daniel-stewart-engage-your-audience-by-getting-to-the-point-using-story-structure-and-forcing-specificity

[Link to Video](https://www.youtube.com/watch?v=vVvcK74h1Mg)

[Link
to Article](https://iandanielstewart.com/2024/06/09/engage-your-audience-by-getting-to-the-point-using-story-structure-and-forcing-specificity/)


### Summary (Chat-GPT) {#summary-chat-gpt}

_Note: This is a generated summary of Vicky Zhao's video, not Ian Daniel
Stewart's article about it._

This video provides strategies for effective communication. It
emphasizes the importance of storytelling for organizing information and
avoiding rambling. The three main tips discussed are:

1.  **Ensuring a central point:** Think about your "one thing" when
    communicating, and branch out from there.
2.  **A "3 Line Scene" Structure:** Start with "one thing," go deeper
    and/or add a surprise, and end with "what's next."
3.  **Specificity:** Embrace _via negativa_ by considering what your point
    _isn't_, rather than all of the things it _is._ This can help with
    specificity. _"The success came not from ... but from ..."_

These tips help in delivering messages more efficiently and avoiding
unnecessary rambling.


### My Thoughts {#my-thoughts}

I came across Ian Daniel Stewart's article online, which led me to Vicky
Zhao's video. As someone with a lot of thoughts and not always the best
organization, I appreciate how clear and straightforward Zhao's tips
are. While the process of earning a doctorate gave me many of these
skills, Zhao's suggestions and the additional context and information
from Stewart are helpful. I can see these resources as being especially
useful for college students and may share Zhao's video the next time I
teach professional writing.


## Daniel Allington, "The LaTeX fetish (Or: Don't write in LaTeX! It's {#daniel-allington-the-latex-fetish-or-don-t-write-in-latex-it-s}

just for typesetting)"

:CUSTOM_ID: daniel-allington-the-latex-fetish-or-dont-write-in-latex-its-just-for-typesetting

[Link to
Article](http://www.danielallington.net/2016/09/the-latex-fetish/)


### Summary (Claude) {#summary-claude}

Allington discusses the merits and drawbacks of using LaTeX, a document
markup language and typesetting system popular among scientists and
academics. The main arguments made are:

1.  LaTeX is often promoted as a tool that allows writers to focus on
    content without worrying about formatting/design. However, the author
    argues this claim is misleading - writing in LaTeX's markup is
    distracting and disrupts the flow of writing prose.
2.  Modern word processors allow structured writing and easy formatting
    changes without dealing with markup. The advantages claimed for LaTeX
    over word processors are either false or based on straw man
    comparisons.
3.  LaTeX is useful for its high-quality typesetting capabilities,
    especially for technical documents with math equations. But it is not
    well-suited as a writing tool for prose.
4.  For those wanting the typesetting benefits of LaTeX, the better
    approach is to write in a word processor or plain text editor, then
    convert to LaTeX for typesetting using conversion tools.
5.  Installing and configuring the LaTeX system is notoriously difficult
    and user-unfriendly compared to word processors.

In summary, the essay debunks common claims that LaTeX is better for
writing and argues it should be used solely as a typesetting tool, not a
writing environment for prose.


### My Thoughts {#my-thoughts-1}

This is one of my favorite articles I've stumbled across in quite a
while. Truthfully, the generated summary included above does a
disservice to Allington's piece, which details _many_ topics of interest
to a documentation nerd like me, including:

-   The history of LaTeX.
-   A consideration of several
    "[docs-as-code](https://www.writethedocs.org/guide/docs-as-code/)"
    approaches to academic writing and their different benefits and
    limitations. (The author doesn't use the term docs-as-code, but I'm
    unsure of another pithy term to refer to what he details.)
-   A discussion of the separation of document design and content that
    challenges a lot of the conventional thinking you'll see if you pay
    attention to the various docs-as-code communities online. (For a great
    discussion of presentation vs. content, see Clark (2007).

If you're interested in the technical side of writing and documentation,
the history of writing media, or academic writing, there is so much to
chew on in this article. It gave me a lot of ideas about my own writing
workflows, and I don't even use LaTeX. I highly recommend the article.


## References {#references}

-   Clark, D. (2007). Content Management and the Separation of
    Presentation and Content. _Technical Communication Quarterly_,
    /17/(1), 35--60. <https://doi.org/10.1080/10572250701588624>
